Revit 2024 API
TableCellStyleOverrideOptions.HorizontalAlignment Property
 Indicates if the horizontal alignment characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool HorizontalAlignment { get; set; }
Visual Basic
Public Property HorizontalAlignment As Boolean
	Get
	Set
Visual C++
public:
property bool HorizontalAlignment {
	bool get ();
	void set (bool value);
}
See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace